Table of Contents
 Class ConversionDictionaryInt
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public sealed class ConversionDictionaryInt : ConversionDictionary<int>, IDictionary<int, int>, ICollection<KeyValuePair<int, int>>, IDictionary, ICollection, IReadOnlyDictionary<int, int>, IReadOnlyCollection<KeyValuePair<int, int>>, IEnumerable<KeyValuePair<int, int>>, IEnumerable, IDeserializationCallback, IXmlSerializable, ISerializable
Inheritance
object
Dictionary<int, int>
SerializableDictionary<int, int>
ConversionDictionary<int>
ConversionDictionaryInt
Implements
IDictionary<int, int>
ICollection<KeyValuePair<int, int>>
IDictionary
ICollection
IReadOnlyDictionary<int, int>
IReadOnlyCollection<KeyValuePair<int, int>>
IEnumerable<KeyValuePair<int, int>>
IEnumerable
IDeserializationCallback
IXmlSerializable
ISerializable
Inherited Members
 ConversionDictionary<int>.Merge(IList<ProjectItem>)
 ConversionDictionary<int>.InitMerge(IList<ProjectItem>)
 ConversionDictionary<int>.MapId(int)
 ConversionDictionary<int>.GetExEntityId(int)
 Dictionary<int, int>.Add(int, int)
 Dictionary<int, int>.Clear()
 Dictionary<int, int>.ContainsKey(int)
 Dictionary<int, int>.ContainsValue(int)
 Dictionary<int, int>.GetEnumerator()
 Dictionary<int, int>.GetObjectData(SerializationInfo, StreamingContext)
 Dictionary<int, int>.OnDeserialization(object)
 Dictionary<int, int>.Remove(int)
 Dictionary<int, int>.TryGetValue(int, out int)
 Dictionary<int, int>.Comparer
 Dictionary<int, int>.Count
 Dictionary<int, int>.Keys
 Dictionary<int, int>.Values
 Dictionary<int, int>.this[int]
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
Methods
 GetKey(int)
protected override int GetKey(int id)
Parameters
id int
Returns
int
 GetKey(string)
protected override int GetKey(string name)
Parameters
name string
Returns
int
 GetSaveKey(int)
public override int GetSaveKey(int Id)
Parameters
Id int
Returns
int
 Edit this page